result = _.invokeMap([[5, 1, 7], [3, 2, 1]], 'sort');
// => [[1, 5, 7], [1, 2, 3]]


resule = _.intersectionWith(x, y, (obj, oth) => obj.НоменклатураГруппа === oth)


obj = [
  {
    "НоменклатураГруппа": "ДИЗЕЛЬ",
    "ЭтоГруппа": "Да",
    "ВидЛимита": "На сутки",
    "ЗначениеЛимита": "300",
    "ДатаОкончания": "06.12.2020 23:59:59",
    "Заправлено": "",
    "Остаток": "300"
  },
  {
    "НоменклатураГруппа": "МОЧЕВИНА",
    "ЭтоГруппа": "Да",
    "ВидЛимита": "На сутки",
    "ЗначениеЛимита": "100",
    "ДатаОкончания": "11.12.2020 23:59:59",
    "Заправлено": "",
    "Остаток": "100"
  },
  {
    "НоменклатураГруппа": "АИ-100-K5",
    "ЭтоГруппа": "Нет",
    "ВидЛимита": "На сутки",
    "ЗначениеЛимита": "100",
    "ДатаОкончания": "05.12.2020 23:59:59",
    "Заправлено": "",
    "Остаток": "100"
  },
  {
    "НоменклатураГруппа": "АИ-100-K5",
    "ЭтоГруппа": "Нет",
    "ВидЛимита": "На месяц",
    "ЗначениеЛимита": "1000",
    "ДатаОкончания": "01.01.0001 0:00:00",
    "Заправлено": "",
    "Остаток": "1000"
  }
]
  
par = [
  "БЕНЗИН",
  "ГАЗЫ",
  "ДИЗЕЛЬ",
  "МОЧЕВИНА"
]


chi = [
  {
    "child": "АИ-100-K5",
    "parent": "БЕНЗИН"
  },
  {
    "child": "АИ-92 ФИРМ-K5",
    "parent": "БЕНЗИН"
  },
  {
    "child": "АИ-92-К5",
    "parent": "БЕНЗИН"
  },
  {
    "child": "АИ-95-К5",
    "parent": "БЕНЗИН"
  },
  {
    "child": "АИ-98-К5",
    "parent": "БЕНЗИН"
  },
  {
    "child": "ГАЗ",
    "parent": "ГАЗЫ"
  },
  {
    "child": "ДТ ФИРМ-К5",
    "parent": "ДИЗЕЛЬ"
  },
  {
    "child": "ДТ-Е-К5",
    "parent": "ДИЗЕЛЬ"
  },
  {
    "child": "ДТ-З-К5",
    "parent": "ДИЗЕЛЬ"
  },
  {
    "child": "ADBLUE Л",
    "parent": "МОЧЕВИНА"
  }
]


filter = _.filter(chi, {parent:input})
//получили массив чайлдов которые нужно проверить в общем массиве
map = _.map(filter, function(o){
  return o.child
})


resule = _.intersectionWith(obj, filter, (x, y) => x.НоменклатураГруппа === y.child)

//=> [
   {
      "Госномер": "С577ХУ116",
      "НоменклатураГруппа": "АИ-100-K5",
      "ЭтоГруппа": "Нет",
      "ВидЛимита": "На сутки",
      "ЗначениеЛимита": "100",
      "ДатаОкончания": "05.12.2020 23:59:59",
      "Заправлено": "",
      "Остаток": "100"
   },
   {
      "Госномер": "С577ХУ116",
      "НоменклатураГруппа": "АИ-100-K5",
      "ЭтоГруппа": "Нет",
      "ВидЛимита": "На месяц",
      "ЗначениеЛимита": "1000",
      "ДатаОкончания": "01.01.0001 0:00:00",
      "Заправлено": "",
      "Остаток": "1000"
   }
]
  

////////////////////////////////////

var users = 
  {
    "ClientCode": "04386",
    "Balance": 3210.31,
    "LimitDeny": -20000,
    "AvailableFunds": 23210.31
  }
;

lowerKeys = _.mapKeys(users, function(value, key) {
  return _.toLower(key);
});

result = _.map([lowerKeys], function(element){
  return _.extend({}, element, {date: '2020-12-02', time: '12:22:22'});
})

  
  
